{
  "posts": [
    {
      "userId": 1,
      "id": 1,
      "title": "How and Why You Should Use React Query",
      "body": "One of the challenges we face when building an application with React is determining a code pattern for fetching data from the server. \nThe most common way to handle data fetching in React is to use the global state as a mechanism to determine the current status of the fetch operation.\n...\n\nRead more here: https://blog.bitsrc.io/how-to-start-using-react-query-4869e3d5680d"
    },
    {
      "userId": 1,
      "id": 2,
      "title": "React Query and Management of Server State",
      "body": "In this article, I’ll explain in more detail which is the problem with the global state and how React Query solves it in an efficient-scalable way.\n...\n\nRead more here: https://www.rootstrap.com/blog/react-query-and-management-of-server-state/"
    },
    {
      "userId": 1,
      "id": 3,
      "title": "Data fetching in Redux is painful, get rid of it now",
      "body": "Although I have been using Redux to handle data fetching in many of my projects, I’ve always believed there must be a better way to do the same with React JS.\n...\n\nRead more here: https://medium.com/@cant89/data-fetching-in-redux-is-painful-get-rid-of-it-now-2b71305268e1"
    },
    {
      "userId": 1,
      "id": 4,
      "title": "The 10 best tools for state management in Front-End",
      "body": "During the last years, thanks to a more logical Frontend, new ways of data management have been created. If we focus our attention in the Post-Flux period, which are the most used libraries or systems/frameworks?\n...\n\nRead more here: https://openexpoeurope.com/the-10-best-tools-for-state-management-in-front-end/"
    },
    {
      "userId": 1,
      "id": 5,
      "title": "Does React Query replace Redux, MobX or other global state managers?",
      "body": "The short answer is that React Query replaces the boilerplate code and related wiring used to manage cache data in your client-state and replaces it with just a few lines of code.\n...\n\nRead more here: https://react-query.tanstack.com/guides/does-this-replace-client-state"
    }
  ]
}
